[
  {
    "id": "1",
    "order": 0,
    "name": "RobotScript",
    "nameShort": "RS",
    "description": [
      "RobotScript es una reversion del entorno de programacion R-Info usada en la facultad UNLP Informatica para la enseñanza de las nociones basicas de programacion como tambien el paradigma de programacion concurrente. Este entorno cuenta con un editor de texto para escribir el codigo del programa y un interprete que ejecuta el programa desarrollado viendo el comportamiento de los robots graficamente.",
      "El objetivo de este proyecto fue modernizar la aplicacion de escritorio existente realizada en Java reemplazandola por una pagina web autocontenida de manera que pueda ser utilizada en cualquier navegador sin la necesidad de descargar ni instalar algo.",
      "El editor de texto ademas de las funcionalidades de su predecesor, cuenta con sugerencias de sintaxis, resaltado de sintaxis mejorado, consola dedicada a mensajes del editor y validaciones al momento de compilacion. Ademas de auto-guardado y subida/descarga de archivos.",
      "Ademas del entorno de desarrollo tambien esta disponible una documentacion de la sintaxis del lenguaje de programacion como tambien un diagrama de flujo de la gramatica del lenguaje."
    ],
    "tags": [
      "Open Source",
      "IDE",
      "Lenguaje de Programacion",
      "Documentacion"
    ],
    "repository": "https://github.com/josu-dev/RobotScript",
    "homepage": "https://josu-dev.github.io/RobotScript/",
    "preview": {
      "gif": "https://res.cloudinary.com/der7w507f/image/upload/v1710978839/me/preview_rs_by7bvr.gif",
      "caption": "Vista previa de uso del entorno de desarrollo"
    }
  },
  {
    "id": "2",
    "order": 1,
    "name": "One More Chance",
    "nameShort": "OMC",
    "description": [
      "One More Chance es un juego de chistes multijugador en tiempo real para jugar con tus amigos por llamada de voz o incluso en persona. El juego consiste en una serie de rondas en las que cada jugador tiene que completar los espacios vacios de una frase para intentar hacer un chiste. Luego todos los jugadores califican las frases y el que mas puntos obenga al final de la partida es el ganador.",
      "Este proyecto nacio como una entrada a la Global Game Jam 2024 de Globant. La idea de la jam era crear un juego dentro de la tematica de \"Risas\" en un plazo de 48 horas. Durante la jam se desarrollo el concepto del juego y la primera version del mismo con un equipo de 4 personas. Luego de la jam continue el desarrollo del juego por mi cuenta hasta llegar a la version actual.",
      "El juego permite crear salas donde los jugadores pueden unirse para jugar, como tambien la creacion de \"mazos\" que son el conjunto de frases las cuales se usan para jugar. Ademas de un ranking global de los jugadores mas graciosos."
    ],
    "tags": [
      "Open Source",
      "Juego de mesa",
      "Game jam",
      "Humor"
    ],
    "repository": "https://github.com/josu-dev/onemorechance",
    "homepage": "https://omc.eventitos.com.ar/",
    "preview": {
      "gif": "https://res.cloudinary.com/der7w507f/image/upload/v1710978566/me/preview_omc_czl5me.gif",
      "caption": "Vista previa de algunas funcionalidades del juego."
    }
  },
  {
    "id": "3",
    "order": 2,
    "name": "Hypercommands",
    "nameShort": "HC",
    "description": [
      "Hypercommands es una libreria para crear Paletas de comandos dentro de tu aplicacion web. Estas paletas son como \"ventanas emergentes\" que aparecen en la pantalla y permiten ejecutar comandos u otras acciones.",
      "Esta libreria tiene un enfoque headless, es decir, no tiene estilos ni componentes visuales predefinidos, sino que se encarga de la logica y la interaccion con el usuario, aunque provee una implementacion de ejemplo para que puedas usarla directamente. El objetivo es que sea altamente customizable para adaptarse a las necesidades de tu aplicacion.",
      "Esta desarrollada para el ecosistema de Svelte siendo compatible con SvelteKit. Es altamente extensible ademas de ofreser una API sencilla y tipos de TypeScript."
    ],
    "tags": [
      "Open Source",
      "Libreria",
      "Commmand Palette",
      "Svelte - SvelteKit"
    ],
    "repository": "https://github.com/josu-dev/svelte-hypercommands",
    "preview": {
      "gif": "https://res.cloudinary.com/der7w507f/image/upload/v1710980486/me/preview_hc_sdhwt4.gif",
      "caption": "Vista previa de uso de la palata de comandos en esta pagina."
    }
  },
  {
    "id": "4",
    "order": 3,
    "name": "Pinta Service",
    "nameShort": "PS",
    "description": [
      "Pinta Service es un sistema web para gestionar los servicios ofrecidos por instituciones o centros de \"Investigación y Desarrollo en Tecnologia de Pinturas\". Fue desarrollado como trabajo final para la materia \"Proyecto de Software\" de la Facultad de Informatica de la UNLP.",
      "El sistema consta de dos paginas, una publica donde los usuarios pueden ver los servicios ofrecidos y realizar las solicitudes de los mismos, y otra privada donde los administradores pueden gestionar las solicitudes y los servicios.",
      "La pagina privada esta bajo el patron de \"Server Side Rendering\" implementada con Flask y Jinja2",
      "La pagina publica esta bajo el patron de \"Single Page Application\" implementada con Vue.js."
    ],
    "tags": [
      "Open Source",
      "Gestion de Servicios",
      "Full Stack",
      "Universidad"
    ],
    "repository": "https://github.com/josu-dev/pintaservice",
    "homepage": "https://pintaservice.onrender.com/",
    "preview": {
      "gif": "https://res.cloudinary.com/der7w507f/image/upload/v1710978566/me/preview_ps_zseexp.gif",
      "caption": "Vista previa de algunas funcionalidades de la pagina publica."
    }
  },
  {
    "id": "5",
    "order": 4,
    "name": "Student Bot",
    "nameShort": "SB",
    "description": [
      "Student Bot es un bot de Discord para la comunidad \"Devs Overflow\". Este bot fue desarrollado para la gestion del servidor de Discord de la comunidad, como tambien brindar utilidades para los miembros.",
      "El bot cuenta con comandos para la gestion de canales, mensajes entre otros. Ademas cuenta con funcionalidades relacionadas a la Facultad de Informatica de la UNLP para facilitar la busqueda de informacion relacionada a la misma port parte de los miembros que pertenecen a la facultad.",
      "Este bot esta basado en la libreria Discord.js extendiendola con declaracion de comandos y eventos mediante el \"File system\". Ofrece una API sencilla para la extension. Los planes a futuro son desarollador una libreria con la funcionalidad principal del bot de manera que pueda ser reutilizada en otros proyectos."
    ],
    "tags": [
      "Open Source",
      "Bot de Discord",
      "TypeScript",
      "Administacion"
    ],
    "homepage": "https://reactjs.org/",
    "preview": {
      "gif": "https://res.cloudinary.com/der7w507f/image/upload/v1710978568/me/preview_sb_nmjnyf.gif",
      "caption": "Vista previa de la carga de funcionalidades del bot."
    }
  }
]
